# Using Python Pandas library

In [24]:
import pandas as pd

## Importing Dataset

In [25]:
dataset=pd.read_csv('main.csv')

## Group by with occupation columns and finding minimum age

In [26]:
d=dataset.groupby('occupation').min('age')

## Group by with occupation columns and finding maximum age

In [27]:
f=dataset.groupby('occupation').max('age')

In [28]:
d.drop(columns='user_id',inplace=True)
f.drop(columns='user_id',inplace=True)

## Renaming columns as min and max

In [29]:
d.rename(columns={"age":"min"},inplace=True)
f.rename(columns={"age":"max"},inplace=True)

## Joining both the tables

In [38]:
res=pd.concat([d, f], axis=1)

## Output

In [39]:
res.head(10)

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53

In [40]:
res.to_csv('Min_Max_ages.csv')